[
  {
    "textName": "welcomeText",
    "EN": "Welcome to Playing OR!",
    "FR": "Jouons à la RO!"
  },
  {
    "textName": "startGameButtonText",
    "EN": "Start Game",
    "FR": "Jouer"
  },
  {
    "textName":"exitGameButtonText",
    "EN": "Exit",
    "FR": "Quitter"
  },
  {
    "textName":"introductionText",
    "EN": "Welcome to the city of OR! The city of Operational Research.\nWe need to manage many things in order to build the perfect and most optimized city ever !\n\nSelect which game you want to play by pressing the buttons on the right.",
    "FR": "Bienvenue à la ville de la RO! La ville de la Recherche Opérationnelle.\nOn a besoin de gérer beaucoup de choses par ici pour construire la ville parfaite et la plus optimisée possible.\n\nChoisis le jeu auquel tu veux jouer en appuyant sur les boutons à droite."
  },
  {
    "textName":"gameName1",
    "EN": "Building",
    "FR": "Construire"
  },
  {
    "textName":"gameName2",
    "EN": "Coming Soon",
    "FR": "Arrive bientôt"
  },
  {
    "textName":"returnButtonText",
    "EN": "Return",
    "FR": "Retour"
  },
  {
    "textName":"chooseDifficultyText",
    "EN": "Choose a difficulty",
    "FR": "Choisissez une difficulté"
  },
  {
    "textName": "chooseLevelText",
    "EN": "Choose a level",
    "FR": "Choisissez un niveau"
  },
  {
  "textName": "hinttutorial1",
  "EN": "A service with the same size but makes you gain more is better.",
  "FR": "Un service de même taille mais qui rapporte plus est mieux."
  },
  {
    "textName": "hinttutorial2",
    "EN": "There is no point in putting a service that costs more to build than what it earns otherwise you will lose money.",
    "FR": "Ça ne sert à rien de mettre un service qui coute plus cher à poser que ce qu'il te rapporte sinon tu perds de l'argent."
  },
  {
    "textName": "hinttutorial3",
    "EN": "Sometimes there are situations where whatever you do you can not be gainful and you can not satisfy anyone.",
    "FR": "Parfois il y a des situations où quoique tu fasses tu ne peux pas être rentable et tu ne peux donc satisfaire personne."
  },
  {
    "textName": "hinttutorial4",
    "EN": "It's getting harder ! This time clients want a different number of floors...",
    "FR": "Ça se corse ! Cette fois les clients veulent un nombre d'étages différents..."
  },
  {
    "textName": "hinttutorial5",
    "EN": "This is the same situation then the precedent level. However, it seems that they offer the same amount of money.",
    "FR": "C'est la même situation que la niveau précéent, par contre ils t'offrent la même somme d'argent on dirait."
  },
  {
    "textName": "hinttutorial6",
    "EN": "This time, you are on your own ! Show me your moves!",
    "FR": "Allez je te laisse te débrouiller pour celle-là! Montre moi ce que tu sais faire."
  },
  {
    "textName": "hint1",
    "EN": "If you put more services you will gain more money from them.\nHowever, you are building higher buildings which makes it more expansive.",
    "FR": "Si vous mettez plus de services vous gagnez plus d'argent de leur part.\nPar contre vous construisez des immeubles plus haut donc plus cher."
  },
  {
    "textName": "hint2",
    "EN": "Look, some blocs have different colors...\nMaybe there is a link with their value.",
    "FR": "Regardez certains blocs ont des couleurs différents...\nPeut-être que cela a un lien avec leur valeur."
  },
  {
    "textName": "hint3",
    "EN": "The best is to have the smaller building that makes you gain the most.\nA way is to take the smaller service.\nBut a well-known strategy is to calculate the ratio gain/size and to take the greater",
    "FR": "Le meilleur est d'avoir le plus petit immeuble qui fait gagner le plus.\nUne manière est de prendre le service le plus petit\nMais une stratégie connue est de calculer le rato gain/taille et de prendre le plus grand"
  },
  {
    "textName": "titlePopUpHint",
    "EN": "Hint",
    "FR": "Indice"
  },
  {
    "textName": "returnText",
    "EN": "return",
    "FR": "retour"
  },
  {
    "textName": "previousText",
    "EN": "previous",
    "FR": "précédent"
  },
  {
    "textName": "nextText",
    "EN": "next",
    "FR": "suivant"
  },
  {
    "textName": "titlePopUpGeneral",
    "EN": "General Explanations",
    "FR": "Explications Générales"
  },
  {
    "textName": "PopUpGeneralText1",
    "EN": "Your goal is to help us make decisions to optimize our city.",
    "FR": "Ton but est de nous aider à prendre des décisions pour optimiser notre ville."
  },
  {
    "textName": "PopUpGeneralText2",
    "EN": "Several situations will be exposed to you.\nYou will need logic and reflexion to get the best result.",
    "FR": "Plusieurs situations te seront exposées.\nTu auras besoin de logique et de réflexion pour obtenir le meilleur résultat."
  },
  {
    "textName": "PopUpGeneralText3",
    "EN": "We will talk about it later but these problems have a link with the Operational Research (OR).\nOR is the discipline regrouping the techniques and methods to get the best result for a given problem.",
    "FR": "On le verra en détail plus tard mais ces problématiques ont un lien avec la Recherche Opérationnelle (RO)\nLa RO est l'ensemble des techniques et méthodes pour obtenir le meilleur résultat pour un problem donné."
  },
  {
    "textName": "titlePopUpBuildingConstruction",
    "EN": "How to Build",
    "FR": "Comment Construire"
  },
  {
    "textName": "PopUpBuildingConstructionText1",
    "EN": "Here's the situation:\nSeverals companies want to invest in our new building projet.\nEach of them ask for a certain number of floors in our new building for a certain amount of money.Yet to build this kind of building costs money and generally the higher it is the more expensive it will be.\n(You can open this manual whenever you'll need it by pressing the manual icon)",
    "FR": "Voici la situation:\nPlusieurs entreprises veulent investir dans notre nouveau projet de construction.\nChacune d'elle veut un certain nombre d'étages dans notre nouveau bâtiment contre une certaine somme d'argent.Cependant construire ce genre de bâtiment coûte de l'argent et généralement plus il est grand plus il est cher.\n(Vous pouvez ouvrir ce manuel à n'importe quel moment en cliquant sur l'icône de manuel)"
  },
  {
    "textName": "PopUpBuildingConstructionText2",
    "EN": "On the right you have several rectangles of different sizes (or not), representing the number of floors asked by the companies, with an amount of money that you will earn if you place them. You can place them in the white rectangle on the left, representing the building.\nOn the left of each floor of the building you have a number, it represents the price of a floor.",
    "FR": "Sur la droite vous avez différents rectangles de différentes tailles (ou non), représentant le nombre d'étages demandés par les clients, avec un montant d'argent que vous allez gagner si vous les placez. Vous pouvez les placer dans le rectangle blanc à gauche, représentant le bâtiment.\nSur la gauche de chaque étage du bâtiment vous avez un nombre, il représente le prix d'un étage."
  },
  {
    "textName": "PopUpBuildingConstructionText3",
    "EN": "Your goal is to maximise the amount of money we will earn by choosing where you put each rectangle.You don't have to put every rectangles into the building.",
    "FR": "Votre but est de maximiser l'argent que nous allons gagner en choisissant où placer chaque rectangle.Vous n'êtes pas obligés de mettre tous les rectangles dans le bâtiment."
  },
  {
    "textName": "PopUpBuildingConstructionText4",
    "EN": "When you think you've finished you can clic on the validate button on the bottom right. You will get a percentage comparing your solution and the optimal one.\nOn the top right, you can clic on bulb icon to get small hints on how to find the optimal solution.",
    "FR": "Quand vous pensez avoir fini vous pouvez appuyer sur le bouton de validation en bas à droite. Vous obtiendrez un pourcentage comparant votre solution et la solution optimale.\nEn haut à droite, vous pouvez appuyer sur l'icône d'ampoule pour obtenir quelques indices sur comment trouver la solution optimale."
  },
  {
    "textName": "winningPercentageText",
    "EN": "Winning percentage",
    "FR": "Pourcentage de réussite"
  },
  {
    "textName": "retryText",
    "EN": "Keep Trying",
    "FR": "Réessayer"
  }
]
